# Необходимо написать программу которая выводит Hello world

# print("Hello world")
# Необходимо объявить 2 целочисленные переменные и сложить их
# результат вывед в консоль

# a = 6
# b = 12
# result = a+b
# print(result)

# Необходимо чтобы пользователь ввёл 2 переменные
# Программа должна их умножить и вывести результат
# пример
# Введите переменную а: 5
# Введите переменную в: 10
# Резлуьтат сложения а и б равен: 50
#
# a = int(input("Введите переменную а "))
# b = int(input("Введите переменную b "))
#
#
# def multiplication_value (value1, value2):
#     print(f'Резлуьтат сложения равен: {value1*value2}')
#
#
# multiplication_value(a,b)

# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.
#
# Пример:
# Ведите ваше имя: Василий
# Ведите ваш пароль: vas
# Введите ваш возраст: 45
# Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45

# age = int(input("Введите ваш возраст "))
# password = str(input("Введите ваш пароль "))
# name = input("Введите ваше имя ")
# weight = float(input("Введите ваш вес "))
#
# print(f'Ваши данные для входа в аккаунт:\n имя - {name} \n пароль - {password} \n возраст - {age} \n вес - {weight} ')